In [1]:
import pandas as pd

In [5]:
data = pd.DataFrame({
    "Name": ["Anna", "Kares", "John", "Alice", "Kevin", "James", "Emily"],
    "Age": [35, 30, 57, 25, 19, 20, 65],
    "Salary": [20000, 60000,145000, 170000, 30000, 10000, 220000],
    "Department": ["Tech", "Tech", "Tech", "Operations", "Operations", "HealthCare", "Tech"]
})

In [6]:
# Sorting the data in ascending order
data.sort_values("Salary",ascending=True)

    Name  Age  Salary  Department
5  James   20   10000  HealthCare
0   Anna   35   20000        Tech
4  Kevin   19   30000  Operations
1  Kares   30   60000        Tech
2   John   57  145000        Tech
3  Alice   25  170000  Operations
6  Emily   65  220000        Tech

In [7]:
# Sorting in Descending order
data.sort_values("Salary", ascending=False)

    Name  Age  Salary  Department
6  Emily   65  220000        Tech
3  Alice   25  170000  Operations
2   John   57  145000        Tech
1  Kares   30   60000        Tech
4  Kevin   19   30000  Operations
0   Anna   35   20000        Tech
5  James   20   10000  HealthCare

In [10]:
# Grouping Data Based on Department using groupby()
# Then count using count()
data.groupby("Department").count()

            Name  Age  Salary
Department
HealthCare     1    1       1
Operations     2    2       2
Tech           4    4       4

In [17]:
# Specifying the actual colum we want to deal with
# and then groupit and count the number of appearences
data.groupby("Department")["Name"].count()

Department
HealthCare    1
Operations    2
Tech          4
Name: Name, dtype: int64

In [19]:
# Calculating the average salary for each Department
data.groupby("Department")["Salary"].mean()

Department
HealthCare     10000.0
Operations    100000.0
Tech          111250.0
Name: Salary, dtype: float64

In [20]:
# Obtaining the minimum of the Salary per department
data.groupby("Department")["Salary"].min()

Department
HealthCare    10000
Operations    30000
Tech          20000
Name: Salary, dtype: int64

In [21]:
# Average Age per department
data.groupby("Department")["Age"].mean()

Department
HealthCare    20.00
Operations    22.00
Tech          46.75
Name: Age, dtype: float64

In [23]:
# Keep only the name and information whose salary is > 100k
# data[] ===> Look into the dataframe
#data.["Department"] ===> Look for a column named Departments
data[data["Salary"] > 100000]

    Name  Age  Salary  Department
2   John   57  145000        Tech
3  Alice   25  170000  Operations
6  Emily   65  220000        Tech

In [25]:
# Keep only the name and information whose salary is > 100k but less than 200k
data[(data["Salary"]>10000) &  (data["Salary"]< 200000)]

    Name  Age  Salary  Department
0   Anna   35   20000        Tech
1  Kares   30   60000        Tech
2   John   57  145000        Tech
3  Alice   25  170000  Operations
4  Kevin   19   30000  Operations

In [28]:
# Filtering using other operations other than < or >
data[data["Age"].isin((25, 65))]

    Name  Age  Salary  Department
3  Alice   25  170000  Operations
6  Emily   65  220000        Tech

In [29]:
# Filtering people whose salary is > 150k but with the ages of 65 and 25
data[(data["Salary"]>150000) & (data["Age"].isin((25, 65)))]

    Name  Age  Salary  Department
3  Alice   25  170000  Operations
6  Emily   65  220000        Tech